backend/app/controllers/books_controller.rb

  def index
    books = Book.all
---
SELECT "books".* FROM "books"

  def show
    book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]