backend/app/controllers/characters_controller.rb

  def create
    Character.create(
      name: params[:name],
      book_id: params[:book_id]
    )
---
INSERT INTO "characters" ("name", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Adolin"], ["book_id", 4], ["created_at", "2020-06-10 16:12:15.721098"], ["updated_at", "2020-06-10 16:12:15.721098"]]